# -*- coding: utf-8 -*-

import datrie
import pickle
#from 上海楼盘 import estate

roadsDic={
  "1号线":
  ["莘庄","外环","莲花","锦江乐园","上海南站","漕宝","上海体育馆","徐家汇","衡山","常熟","陕西南","黄陂南","人民广场","新闸","汉中","上海火车站","中山北","延长","上海马戏城","汶水","彭浦新村","共康","通河新村","呼兰","共富新村","宝安公","友谊西","富锦"],
  "2号线":
  ["浦东国际机场","海天三","远东大道","凌空","川沙","华夏东","创新中","唐镇","广兰","金科","张江高科","龙阳","世纪公园","上海科技馆","世纪大道","东昌","陆家嘴","南京东","人民广场","南京西","静安寺","江苏","中山公园","娄山关","威宁","北新泾","淞虹","虹桥1号航站楼","虹桥2号航站楼","虹桥火车站","徐泾东"],
  "3号线":
  [ "上海南站", "石龙", "龙漕", "漕溪", "宜山", "虹桥", "延安西", "中山公园", "金沙江", "曹杨", "镇坪", "中潭", "上海火车站", "宝山", "东宝兴", "虹口足球场", "赤峰", "大柏树", "江湾", "殷高西", "长江南", "淞发", "张华浜", "淞滨", "水产", "宝杨", "友谊", "铁力", "江杨北"],
  "4号线":
  ["宜山","上海体育馆","上海体育场","东安","大木桥","鲁班","西藏南","南浦大桥","塘桥","蓝村","浦电","世纪大道","浦东大道","杨树浦","大连","临平","海伦","宝山","上海火车站","中潭","镇坪","曹杨","金沙江","中山公园","延安西","虹桥"],
  "5号线":
  [ "莘庄", "春申", "银都", "颛桥", "北桥", "剑川", "东川", "金平", "华宁", "文井", "闵行开发区"],
  "6号线":
  [ "港城", "外高桥", "保税区北", "航津", "外高桥", "保税区南", "洲海", "五洲大道", "东靖", "巨峰", "五莲", "博兴", "金桥", "云山", "德平", "北洋泾", "民生", "源深体育", "中心", "世纪大道", "浦电", "蓝村", "上海儿童", "医学中心", "临沂新村", "高科西", "东明", "高青", "华夏西",  "灵岩南", "东方体育中心"],
  "7号线":
  [ "花木", "龙阳", "芳华", "锦绣", "杨高南", "高科西", "云台", "耀华", "长清", "后滩", "船厂", "东安", "肇嘉浜", "常熟", "静安寺", "昌平", "长寿", "镇坪", "岚皋", "新村", "大华三", "行知", "大场", "场中", "上大", "南陈", "上海大学", "顾村公园", "刘行", "潘广", "罗南新村", "美兰湖"],
  "8号线":
  ["航天博物馆","沈灶公","联航","江月","浦江","芦恒","凌兆新村","东方体育中心","杨思","成山","耀华","周家渡","西藏南","陆家浜","老西门","大世界","人民广场","曲阜","中兴","西藏北","虹口足球场","曲阳","四平","鞍山新村","江浦","黄兴","延吉中","黄兴公园","翔殷","嫩江","市光"],
  "9号线":
  [ "杨高中", "世纪大道", "商城", "小南门", "陆家浜", "马当", "打浦桥", "嘉善", "肇嘉浜", "徐家汇", "宜山", "桂林", "漕河泾", "开发区", "合川", "星中", "七宝", "中春", "九亭", "泗泾", "佘山", "洞泾", "松江大学城", "松江新城", "松江体育中心", "醉白池", "松江南站"],
  "10号线":
  [ "新江湾城", "殷高东", "三门", "江湾体育场", "五角场", "国权", "同济大学", "四平", "邮电新村", "海伦", "四川北", "天潼", "南京东", "豫园", "老西门", "新天地", "陕西南", "上海图书馆", "交通大学", "虹桥", "宋园", "伊犁", "水城", "龙溪", "上海动物园", "虹桥1号航站楼", "虹桥2号航站楼", "虹桥火车站", "龙柏新村", "紫藤", "航中"],
  "11号线":
  [ "罗山", "御桥", "浦三", "三林东", "三林", "东方体育中心", "龙耀", "云锦", "龙华", "上海游泳馆", "徐家汇", "交通大学", "江苏", "隆德", "曹杨", "枫桥", "真如", "上海西站", "李子园", "祁连山", "武威", "桃浦新村", "南翔", "马陆", "嘉定新城", "白银", "嘉定西", "嘉定北", "上海赛车场", "昌吉东", "上海汽车城", "安亭"],
  "12号线":
  [ "金海", "申江", "金京", "杨高北", "世峰", "东陆", "复兴岛", "爱国", "隆昌", "江浦公园", "大连", "提篮桥", "国际客运", "中心", "天潼", "曲阜"],
  "13号线":
  [ "金沙江", "大渡河", "真北", "祁连山南", "丰庄", "金沙江西", "金运"],
  "16号线":
  [ "罗山", "周浦东", "鹤沙航城", "航头东", "新场", "野生动物园", "惠南", "惠南东", "书院", "临港大道", "滴水湖"]
}
streets=["一号线", "二号线", "三号线", "四号线", "五号线", "六号线", "七号线", "八号线", "九号线", "十号线", "十一号线", "十二号线", "十三号线", "十六号线","一环","二环","三环","四环","中环","市区","爱国路", "孙建路","安波路", "安德路", "安亭路", "安亭镇墨玉路", "安图路", "安远路", "澳门路", "八一路", "巴林路", "白城路", "白城南路", "白渡桥", "百色路", "板泉路", "包头路", "包头南路", "宝安公路", "宝联路", "宝山大华新沪路", "宝杨路", "保定路", "保屯路", "北艾路", "北虹路", "北京东路", "北京西路", "北苏州路", "北张家浜路", "本溪路", "碧波路", "碧云国际社区", "碧云路", "滨江大道", "波阳路", "博乐南路", "蔡伦路", "沧州路", "曹安路", "曹杨路", "漕宝路", "漕溪北路", "漕溪路", "茶陵路", "昌化路", "昌平路", "昌邑路", "常德路", "场中路", "车亭公路", "成山路", "城南路", "城中北路", "城中路", "程家桥路", "赤峰路", "川环南路", "川黄路", "川六公路", "川南", "川南奉公路", "川沙路", "川沙镇", "川周公路", "春江路", "春申路", "打浦路", "大渡河路", "大华二路", "大连路", "大连西路", "大林路", "大通路", "大同路", "大统路", "大学路", "滇池路", "丁香路", "定海港路", "定海路", "定西路", "东宝兴路", "东昌路", "东川路", "东大名路", "东方路", "东汉阳路", "东湖路", "东兰路", "东平国家森林公园", "东台路", "东滩团结沙", "东体育会路", "东新路", "东绣路", "东诸安浜路", "敦化路", "峨山路", "番禺路", "芳甸路", "芳华路", "汾阳路", "枫桥路", "凤城路", "奉公路", "福建南路", "福山路", "福佑路", "福州路", "复兴东路", "富城路", "甘河路", "高科西路", "高桥慈善街", "高桥镇慈善街", "高阳路", "共和新路", "共江路", "共康路", "共青路", "古北路", "古北荣华东道19弄", "古井路", "谷阳北路", "顾戴路", "崮山路", "关山路", "冠生园路", "光复西路", "广德路", "广东路", "广富林路", "广纪路", "广兰路", "广灵二路", "广灵四路", "广灵一路", "广西南路", "广元西路", "广粤路", "广中路", "广中西路", "贵阳路", "贵州路", "桂林路", "桂平路", "国宾路", "国达路", "国定东路", "国定路", "国栋路", "国福路", "国和路", "国济路", "国济路", "国京路", "国康路", "国科路", "国年路", "国庆路", "国权北路", "国权东路", "国权后路", "国权路", "国顺东路", "国顺路", "国泰路", "国庠路", "哈密路", "海安路", "海城路", "海鸥路", "海湾路", "海湾旅游区", "海州路", "邯郸路", "汉口路", "杭州湾大道", "航城路", "航津路", "合庆镇人民塘", "河间路", "河南南路", "河南中路", "鹤庆路", "黑山路", "黑山南路", "恒丰北路", "恒丰路", "恒仁路", "恒通路", "衡山路", "红枫路", "红松东路", "虹古路", "虹井路", "虹梅路", "虹梅南路", "虹桥机场迎宾三路", "虹桥路", "虹泉路", "虹莘路", "虹许路", "虹中路", "洪山路", "湖北路", "湖南路", "沪闵路", "沪南公路", "沪南路", "沪青平公路", "沪太路", "沪亭南路", "沪星路", "花木路", "花山路", "花园路", "华山路", "华夏东路", "华翔路", "华新镇华滕路", "华洲路", "淮海西路", "淮海中路", "环城路", "环湖西二路", "环华路", "环龙路", "环镇西路", "黄陂南路", "黄桦路", "黄金城道", "黄浦路", "黄兴路", "黄杨路", "辉河路", "汇川路", "汇源路", "惠民路", "霍山路", "机场大道", "机场镇新建路", "吉浦路", "吉祥路", "即墨路", "纪念路", "佳木斯路", "建国西路", "建国中路", "江海路", "江宁路", "江浦路", "江苏北路", "江西中路", "江镇路", "交通路", "胶州路", "解放街", "解放中路", "金港路", "金高炉", "金高路", "金汇路", "金汇塘路", "金科路", "金陵东路", "金桥路", "金沙江路", "金皖路", "金新路", "金一东路", "锦州湾路", "锦尊路", "晋元路", "靖宇东路", "靖宇南路", "靖宇中路", "九杜路", "九江路", "居家桥路", "巨峰路", "巨鹿路", "俱进路", "卡园路", "凯旋北路", "凯旋路", "康定路", "空港一路", "控江路", "昆阳路", "兰田路", "蓝村路", "崂山东路", "老沪闵路", "乐园路", "黎平路", "历城路", "溧阳路", "莲花路", "凉州路", "辽源东路", "辽源西路", "林泉路", "林荫新路", "临港新城", "临青路", "临潼路", "临沂北路", "灵石路", "灵岩南路", "零陵路", "浏河路", "柳营路", "柳州路", "龙漕路", "龙东大道", "龙华路", "龙华西路", "龙江路", "龙金路", "龙茗路", "龙胜路", "龙水南路", "龙吴路", "龙阳路", "隆安路", "隆昌路", "陆家浜路", "陆家嘴环路", "罗浮路", "罗锦路", "罗香路", "罗秀路", "洛川中路", "茂名南路", "眉州路", "梅花路", "梅家浜路", "梅陇路", "蒙自路", "苗圃路", "妙境路", "民府路", "民京路", "民乐路", "民生路", "民星路", "民主路", "民壮路", "秣陵路", "牡丹江路", "南丹东路", "南丹路", "南奉公路", "南汇康桥", "南汇新元南路", "南京东路", "南京西路", "南芦路", "南码头路", "南桥路", "南泉北路", "南山路", "南苏州路", "南阳路", "内江路", "嫩江路", "宁波路", "宁国路", "宁武路", "宁夏路", "牛庄路", "怒江北路", "怒江路", "盘山路", "平定路", "平凉路", "平武路", "蒲汇塘路", "浦电路", "浦东大道", "浦东南路", "浦东世纪大道", "浦建路", "浦明路", "浦三路", "浦西路", "普善路", "普照路", "七莘路", "栖山路", "祁连山路", "祁连山南路", "启航路", "钦江路", "钦州北路", "钦州路", "沁春路", "青安路", "青石路", "青赵公路", "清河路", "清真路", "虬江路", "虬江码头路", "曲阳路", "人民北路", "人民路", "人民南路", "人民中路", "茸北镇茸梅路", "荣乐东路", "荣乐中路", "乳山路", "瑞金二路", "三江路", "三林路", "三鲁路", "三门路", "三星路", "沙岗路", "厦门路", "山西南路", "陕西北路", "陕西南路", "商城路", "上海国权路", "上海黄浦路", "上海梅岭南路", "上海四平路", "上南路", "佘天昆路", "申波路", "申富路", "莘北路", "莘松路", "沈太路", "盛龙路", "石化龙胜路", "石龙路", "石门二路", "石门一路", "世博村路", "世纪大道", "世纪塘路", "世界路", "寿宁路", "舒兰路", "双峰林场", "双阳北路", "双阳路", "双阳支路", "水产路", "水城路", "水电路", "水丰路", "思南路", "四川北路", "四川中路", "四平路", "泗陈公路", "松花江路", "松江人民北路", "松林路", "松潘路", "松卫北路", "淞沪路", "宋园路", "太仓路", "泰环路", "泰兴路", "塘桥路", "桃浦路", "腾克路", "腾越路", "天宝路", "天等路", "天津路", "天目东路", "天目西路", "天目中路", "天山路", "天山西路", "天潼路", "天钥桥路", "田林东路", "田林路", "同济路", "同泰北路", "图们路", "外高桥保税区", "外滩中山东一路", "宛平路", "宛平南路", "畹町路", "万航渡路", "万源路", "望园路", "威海路", "潍坊路", "潍纺西路", "卫清西路", "文诚路", "文定路", "汶水东路", "吴宝路", "吴凇路", "吴中路", "武川路", "武定路", "武定西路", "武东路", "武宁路", "武宁南路", "武夷路", "西藏北路", "西藏南路", "西藏中路", "西江湾路", "西康路", "西林北路", "西乡路", "夏碧路", "仙霞路", "香港路", "襄阳南路", "翔殷路", "翔殷支路", "向城路", "小木桥路", "斜土东路", "斜土路", "新城路", "新崇南路", "新川路", "新村路", "新华路", "新会路", "新金桥路", "新灵路", "新市南路", "新松江路", "新闸路", "新镇路", "星火开发区", "杏山路", "徐虹中路", "徐家汇路", "徐家汇文定路", "许昌路", "学府街", "延安东路", "延安西路", "延安中路", "延吉东路", "延吉西路", "延吉中路", "延平路", "延长路", "延长西路", "延长中路", "雁荡路", "杨高北路", "杨高南路", "杨高中路", "杨树浦路", "杨宅路", "叶城路", "叶家宅路", "伊犁路", "伊犁南路", "伊敏河路", "宜山路", "逸仙路", "殷高路", "银都路", "樱花路", "迎宾大道", "迎春路", "营口路", "永吉路", "永清路", "永寿路", "永兴路", "友谊路", "余姚路", "愚园路", "羽山路", "源泉路", "源深路", "月浦镇双泉路", "岳阳路", "云南南路", "云洲路", "运光路", "枣阳路", "闸殷路", "乍浦路", "张东路", "张江高科技园区", "张江路", "张江镇建中路", "张扬路", "张杨路", "彰武路", "长安路", "长白路", "长春路", "长海路", "长乐路", "长柳路", "长宁店", "长宁路", "长寿路", "长阳路", "肇嘉浜路", "浙桥路", "真北路", "真光路", "真南路", "镇宁路", "镇通济路", "政本路", "政旦东路", "政德东路", "政府路", "政化路", "政立路", "政民路", "政肃路", "政通路", "政熙路", "政修路", "政云路", "政治路", "芷江西路", "芷江中路", "志丹路", "制造局路", "智星路", "中华新路", "中江路", "中宁路", "中山北二路", "中山北路", "中山北一路", "中山东路", "中山南二路", "中山南路", "中山西路", "中兴路", "中谊路", "中原路", "众仁路", "周家牌路", "周家嘴路", "周康路", "朱家角镇西井街", "朱泾镇文商路", "颛兴东路", "紫薇路", "祖冲之路", "遵义路", "遵义南路"]
adminAreas=["黄浦", "外滩","钥桥路","南京东", "半淞园", "小东门", "老西门", "豫园", "卢湾", "打浦桥", "淮海中", "瑞金二", "五里桥", "徐汇", "湖南", "天平", "枫林", "徐家汇", "斜土", "长桥", "漕河泾", "康健新村", "虹梅", "田林", "凌云", "龙华", "华泾", "长宁", "华阳", "新华", "江苏", "天山", "周家桥", "虹桥", "仙霞新村", "程家桥", "北新泾", "新泾", "静安", "江宁", "静安寺", "南京西", "曹家渡", "石门二", "普陀", "长寿", "曹杨新村", "长风新村", "宜川", "甘泉", "石泉", "真如", "长征", "桃浦", "闸北", "天目西", "北站", "宝山", "芷江西", "共和新", "大宁", "彭浦新村", "临汾", "彭浦", "虹口", "四川北", "提篮桥", "欧阳", "广中", "凉城新村", "嘉兴", "曲阳", "江湾", "杨浦", "定海", "大桥", "平凉", "江浦", "控江", "殷行", "长白新村", "延吉新村", "五角场", "四平", "新江湾城", "五角场", "闵行", "江川", "古美", "新虹", "莘庄", "七宝", "浦江", "梅陇", "虹桥", "马桥", "吴泾", "华漕", "颛桥", "宝山", "吴淞", "张庙", "友谊", "庙行", "罗店", "大场", "顾村", "罗泾", "杨行", "月浦", "淞南", "高境", "嘉定", "嘉定", "新成", "真新", "马陆", "南翔", "江桥", "安亭", "外冈", "徐行", "华亭", "浦东", "潍坊新村", "陆家嘴", "塘桥", "周家渡", "东明", "洋泾", "上钢新村", "沪东新村", "金杨新村", "浦兴", "南码头", "花木", "申港办事处", "川沙新", "合庆", "曹镇", "高东", "高桥", "高行", "金桥", "张江", "唐镇", "北蔡", "三林", "惠南", "新场", "大团", "周浦", "航头", "芦潮港", "康桥", "宣桥", "六灶", "祝桥", "泥城", "书院", "万祥", "老港", "金山", "石化枫泾", "朱泾", "亭林", "漕泾", "山阳", "金山卫", "张堰", "廊下", "吕巷", "松江", "岳阳", "中山", "永丰", "方松", "九亭", "泗泾", "泖港", "车墩", "洞泾", "叶榭", "新桥", "石湖荡", "新浜", "佘山", "小昆山", "青浦", "夏阳", "盈浦", "香花桥", "赵巷", "徐泾", "华新", "重固", "白鹤", "朱家角", "练塘", "金泽", "奉贤", "南桥", "庄行", "金汇", "柘林", "青村", "奉城", "四团", "海湾", "崇明", "城桥", "堡镇", "庙镇", "中兴", "新河", "三星", "向化", "绿华", "建设", "陈家", "竖新", "港西", "港沿", "新海", "东平", "长兴", "新村乡", "横沙乡"]
prices=["五百", "六百", "七百", "八百", "九百", "一千", "二千", "三千", "四千", "五千", "六千", "七千", "八千", "九千", "一千一", "一千二", "一千三", "一千四", "一千五", "一千六", "一千七", "一千八", "一千九", "二千一", "二千二", "二千三", "二千四", "二千五", "二千六", "二千七", "二千八", "二千九", "两千一", "两千二", "两千三", "两千四", "两千五", "两千六", "两千七", "两千八", "两千九", "三千一", "三千二", "三千三", "三千四", "三千五", "三千六", "三千七", "三千八", "三千九", "四千一", "四千二", "四千三", "四千四", "四千五", "四千六", "四千七", "四千八", "四千九", "五千一", "五千二", "五千三", "五千四", "五千五", "五千六", "五千七", "五千八", "五千九", "六千一", "六千二", "六千三", "六千四", "六千五", "六千六", "六千七", "六千八", "六千九", "七千一", "七千二", "七千三", "七千四", "七千五", "七千六", "七千七", "七千八", "七千九", "八千一", "八千二", "八千三", "八千四", "八千五", "八千六", "八千七", "八千八", "八千九","500", "600", "700", "800", "900", "1000", "2000", "3000", "4000", "5000", "6000", "7000", "8000", "9000", "1100", "1200", "1300", "1400", "1500", "1600", "1700", "1800", "1900", "2100", "2200", "2300", "2400", "2500", "2600", "2700", "2800", "2900", "3100", "3200", "3300", "3400", "3500", "3600", "3700", "3800", "3900", "4100", "4200", "4300", "4400", "4500", "4600", "4700", "4800", "4900", "5100", "5200", "5300", "5400", "5500", "5600", "5700", "5800", "5900", "6100", "6200", "6300", "6400", "6500", "6600", "6700", "6800", "6900", "7100", "7200", "7300", "7400", "7500", "7600", "7700", "7800", "7900", "8100", "8200", "8300", "8400", "8500", "8600", "8700", "8800", "8900","550", "650", "750", "850", "950", "1050", "2050", "3050", "4050", "5050", "6050", "7050", "8050", "9050", "1150", "1250", "1350", "1450", "1550", "1650", "1750", "1850", "1950", "2150", "2250", "2350", "2450", "2550", "2650", "2750", "2850", "2950", "3150", "3250", "3350", "3450", "3550", "3650", "3750", "3850", "3950", "4150", "4250", "4350", "4450", "4550", "4650", "4750", "4850", "4950", "5150", "5250", "5350", "5450", "5550", "5650", "5750", "5850", "5950", "6150", "6250", "6350", "6450", "6550", "6650", "6750", "6850", "6950", "7150", "7250", "7350", "7450", "7550", "7650", "7750", "7850", "7950", "8150", "8250", "8350", "8450", "8550", "8650", "8750", "8850", "8950"]
priceDic={"五百": 500, "六百": 600, "七百": 700, "八百": 800, "九百": 900, "一千": 1000, "二千": 2000, "三千": 3000, "四千": 4000, "五千": 5000, "六千": 6000, "七千": 7000, "八千": 8000, "九千": 9000, "一千一": 1100, "一千二": 1200, "一千三": 1300, "一千四": 1400, "一千五": 1500, "一千六": 1600, "一千七": 1700, "一千八": 1800, "一千九": 1900, "二千一": 2100, "二千二": 2200, "二千三": 2300, "二千四": 2400, "二千五": 2500, "二千六": 2600, "二千七": 2700, "二千八": 2800, "二千九": 2900, "两千一": 2100, "两千二": 2200, "两千三": 2300, "两千四": 2400, "两千五": 2500, "两千六": 2600, "两千七": 2700, "两千八": 2800, "两千九": 2900, "三千一": 3100, "三千二": 3200, "三千三": 3300, "三千四": 3400, "三千五": 3500, "三千六": 3600, "三千七": 3700, "三千八": 3800, "三千九": 3900, "四千一": 4100, "四千二": 4200, "四千三": 4300, "四千四": 4400, "四千五": 4500, "四千六": 4600, "四千七": 4700, "四千八": 4800, "四千九": 4900, "五千一": 5100, "五千二": 5200, "五千三": 5300, "五千四": 5400, "五千五": 5500, "五千六": 5600, "五千七": 5700, "五千八": 5800, "五千九": 5900, "六千一": 6100, "六千二": 6200, "六千三": 6300, "六千四": 6400, "六千五": 6500, "六千六": 6600, "六千七": 6700, "六千八": 6800, "六千九": 6900, "七千一": 7100, "七千二": 7200, "七千三": 7300, "七千四": 7400, "七千五": 7500, "七千六": 7600, "七千七": 7700, "七千八": 7800, "七千九": 7900, "八千一": 8100, "八千二": 8200, "八千三": 8300, "八千四": 8400, "八千五": 8500, "八千六": 8600, "八千七": 8700, "八千八": 8800, "八千九": 8900}
tags=["求租", "想租","求到","求从", "要租", "寻租","寻找", "找新房子", "找房子", "找房", "寻房", "求房", "想找", "希望房"]

roads=list(roadsDic.keys())
for k in roadsDic.keys():
    roads.extend(roadsDic[k])
#地铁
adminAreas.extend(roads)
#街道
adminAreas.extend(streets)
#楼盘
#adminAreas.extend(estate)
adminAreas=list(set(adminAreas))
#tAdmin=datrie.BaseTrie(ranges=[('\u4e00', '\u9fcb'),('\uf900','\ufad6')])
adminWords=set(''.join(adminAreas))
#建立字典
tAdmin=datrie.BaseTrie(list(adminWords))
tPrice=datrie.BaseTrie("一二两三四五六七八九十百千1234567890")
tTag=datrie.BaseTrie(set(''.join(tags)))

for i,aA in enumerate(adminAreas):
    tAdmin[aA]=i
for r in prices:
    # 键值对应字符串和整数
    if ord(r[0])>60:
        tPrice[r]=priceDic[r]  
    else:
        tPrice[r]=int(r)
for t in tags:
    tTag[t]=0



data={'admin':tAdmin,'price':tPrice,'tag':tTag}
with open('data.pl','wb') as f:
    pickle.dump(data,f)   
      
            
        
        